# точки с локацией для гонки
points = {'Start': {'latitude': 55.74905, 'longitude': 37.64259},
          '1st': {'latitude': 55.70283, 'longitude': 37.53097},
          '2nd': {'latitude': 55.75165, 'longitude': 37.56624},
          '3rd': {'latitude': 55.74602, 'longitude': 37.58402},
          '4th': {'latitude': 55.75910, 'longitude': 37.58058},
          '5th': {'latitude': 55.76924, 'longitude': 37.64902},
          '6th': {'latitude': 55.77420, 'longitude': 37.65202},
          'Finish': {'latitude': 55.75285, 'longitude': 37.66907},
          }

"""
1 - МГУ - 55.70283 37.53097
2 - Отель Украина - 55.75165, 37.56624
3 - Здание МИД РФ - 55.74602, 37.58402
4 - Высотка на Кудринской площади - 55.75910, 37.58058
5 - Высотка на Красныхых Воротах - 55.76924, 37.64902
6 - Гостиница Ленинградская - 55.77420, 37.65202
"""
