#точки с локацией для гонки
points = {'Устьинский сквер, Памятник Пограничникам Отечества': {'latitude': 55.749, 'longitude': 37.643},
          'Церковь Спаса Преображения в комплексе храма Христа Спасителя': {'latitude': 55.744, 'longitude': 37.604},
          'Римско-католический Кафедральный собор Непорочного Зачатия Пресвятой Девы Марии': {'latitude': 55.767,
                                                                                              'longitude': 37.572},
          'Московская соборная мечеть': {'latitude': 55.779, 'longitude': 37.626},
          'Московская хоральная синагога': {'latitude': 55.755, 'longitude': 37.635},
          'Евангелическо-лютеранский кафедральный собор святых Петра и Павла': {'latitude': 55.757,
                                                                                'longitude': 37.64},
          'Московская саентологическая церковь': {'latitude': 55.739, 'longitude': 37.690},
          'Mosgorbike': {'latitude': 55.753, 'longitude': 37.669},
          }

