points = {'Устьинский сквер, Памятник Пограничникам Отечества': {'latitude': 55.749, 'longitude': 37.643},
          'Христа Спасителя': {'latitude': 55.744, 'longitude': 37.604},
          'Римско-католический Кафедральный собор Непорочного Зачатия Пресвятой Девы Марии': {'latitude': 55.767,
                                                                                              'longitude': 37.572},
          'Московская соборная мечеть': {'latitude': 55.778, 'longitude': 37.626},
          'Московская хоральная синагога': {'latitude': 55.755, 'longitude': 37.635450},
          'Евангелическо-лютеранский кафедральный собор святых Петра и Павла': {'latitude': 55.756,
                                                                                'longitude': 37.639},
          'Московская саентологическая церковь': {'latitude': 55.739, 'longitude': 37.690},
          'Mosgorbike': {'latitude': 55.752, 'longitude': 37.669},
          # "Dom": {"latitude": 55.611, "longitude": 37.254}
          }
