'''сделать точные координаты'''


START_POINT = [55.75, 37.64]  # Устьинский сквер, Памятник Пограничникам Отечества
CHRIST_THE_SAVIOR = [55.74, 37.61]  # Кафедральный соборный храм Христа Спасителя
CATHOLIC_CATHEDRAL = [55.76, 37.57]  # Римско-католический Кафедральный собор Непорочного Зачатия Пресвятой Девы Марии
ALLAAH = [55.77, 37.62]  # Московская соборная мечеть
SEYNAGOUE = [55.75, 37.63]  # Московская хоральная синагога
EVANGELICAL_LUTHERAN_CATHEDRAL = [55.75, 37.63]  # Евангелическо-лютеранский кафедральный собор святых Петра и Павла
SCIENTOLOGY = [55.73, 37.69]  # Московская саентологическая церковь
MOSGORBIKE = [55.75, 37.66]

points = {'Устьинский сквер, Памятник Пограничникам Отечества': {'latitude': 55.75, 'longitude': 37.64},
          'Римско-католический Кафедральный собор Непорочного Зачатия Пресвятой Девы Марии': {'latitude': 55.74,
                                                                                              'longitude': 37.64},
          'Кафедральный собор': {'latitude': 55.74, 'longitude': 37.64},
          'Московская соборная мечеть': {'latitude': 55.74, 'longitude': 37.64},
          'Московская хоральная синагога': {'latitude': 55.74, 'longitude': 37.64},
          'Евангелическо-лютеранский кафедральный собор святых Петра и Павла': {'latitude': 55.74, 'longitude': 37.64},
          'Московская саентологическая церковь': {'latitude': 55.74, 'longitude': 37.64},
          'Mosgorbike': {'latitude': 50.427714, 'longitude': 30.538275},
          }
